klutzware/DesignLab/hardware/zpuino/zpu20/boards.txt
zpuino20_papilio_prolx9v.name=ZPUino 2.0 on Papilio Pro (LX9)
zpuino20_papilio_prolx9v.boardid=0xB4041700
zpuino20_papilio_prolx9v.upload.protocol=zpuino-serial
zpuino20_papilio_prolx9v.upload.maximum_size=8388608
zpuino20_papilio_prolx9v.upload.size_sections=all
zpuino20_papilio_prolx9v.upload.speed=1000000
zpuino20_papilio_prolx9v.upload.tool=zpuinoprogrammer
zpuino20_papilio_prolx9v.build.f_cpu=96000000L
zpuino20_papilio_prolx9v.build.core=zpuino
zpuino20_papilio_prolx9v.build.mcu=zpu
zpuino20_papilio_prolx9v.build.toolchain=zpu
zpuino20_papilio_prolx9v.build.board=ZPUINO_PAPILIO_PRO
zpuino20_papilio_prolx9v.build.extra_flags=-D__ZPUINO_PAPILIO_PRO__ -DZPU20 -DBOARD_ID=0xB4041700 -DBOARD_MEMORYSIZE=0x800000 -nostartfiles
zpuino20_papilio_prolx9v.build.extraSflags=-DBOARD_ID=0xB4041700
##############################################################
zpuino20_xula2_lx9.name=ZPUino 2.0 on XuLA2 (LX9)
zpuino20_xula2_lx9.boardid=0xB6011900
zpuino20_xula2_lx9.upload.protocol=zpuino-serial
zpuino20_xula2_lx9.upload.maximum_size=8388608
zpuino20_xula2_lx9.upload.size_sections=all
zpuino20_xula2_lx9.upload.speed=1000000
zpuino20_xula2_lx9.upload.tool=zpuinoprogrammer
zpuino20_xula2_lx9.build.f_cpu=96000000L
zpuino20_xula2_lx9.build.core=zpuino
zpuino20_xula2_lx9.build.mcu=zpu
zpuino20_xula2_lx9.build.toolchain=zpu
zpuino20_xula2_lx9.build.board=ZPUINO_XULA2
zpuino20_xula2_lx9.build.extra_flags=-D__ZPUINO_XULA2__ -DBOARD_ID=0xB6011900 -DBOARD_MEMORYSIZE=0x2000000 -nostartfiles
zpuino20_xula2_lx9.build.extraSflags=-DBOARD_ID=0xB6011900
##############################################################
zpuino20_xula2_lx25.name=ZPUino 2.0 on XuLA2 (LX25)
zpuino20_xula2_lx25.boardid=0xBA011900
zpuino20_xula2_lx25.upload.protocol=zpuino-serial
zpuino20_xula2_lx25.upload.maximum_size=8388608
zpuino20_xula2_lx25.upload.size_sections=all
zpuino20_xula2_lx25.upload.speed=1000000
zpuino20_xula2_lx25.upload.tool=zpuinoprogrammer
zpuino20_xula2_lx25.build.f_cpu=96000000L
zpuino20_xula2_lx25.build.core=zpuino
zpuino20_xula2_lx25.build.mcu=zpu
zpuino20_xula2_lx25.build.toolchain=zpu
zpuino20_xula2_lx25.build.board=ZPUINO_XULA2
zpuino20_xula2_lx25.build.extra_flags=-D__ZPUINO_XULA2__ -DBOARD_ID=0xBA011900 -DBOARD_MEMORYSIZE=0x2000000 -nostartfiles
zpuino20_xula2_lx25.build.extraSflags=-DBOARD_ID=0xBA011900
##############################################################
zpuino20_ems11_bb_lx45.name=ZPUino 2.0 on EMS11-BB-v22 (LX45)
zpuino20_ems11_bb_lx45.boardid=0xB8011900
zpuino20_ems11_bb_lx45.upload.protocol=zpuino-serial
zpuino20_ems11_bb_lx45.upload.maximum_size=8388608
zpuino20_ems11_bb_lx45.upload.size_sections=all
zpuino20_ems11_bb_lx45.upload.speed=1000000
zpuino20_ems11_bb_lx45.upload.tool=zpuinoprogrammer
zpuino20_ems11_bb_lx45.build.f_cpu=90000000L
zpuino20_ems11_bb_lx45.build.core=zpuino
zpuino20_ems11_bb_lx45.build.mcu=zpu
zpuino20_ems11_bb_lx45.build.toolchain=zpu
zpuino20_ems11_bb_lx45.build.board=ZPUINO_EMS11
zpuino20_ems11_bb_lx45.build.extra_flags=-D__ZPUINO_EMS11__ -DBOARD_REV=22 -DBOARD_ID=0xB8011900 -DBOARD_MEMORYSIZE=0x2000000 -nostartfiles
zpuino20_ems11_bb_lx45.build.extraSflags=-DBOARD_ID=0xB8011900 -DBOARD_REV=22
##############################################################
zpuino20_pipistrello_lx45.name=ZPUino 2.0 on Saanlima Pipistrello (LX45)
zpuino20_pipistrello_lx45.boardid=0xBA011A00
zpuino20_pipistrello_lx45.upload.protocol=zpuino-serial
zpuino20_pipistrello_lx45.upload.maximum_size=67108864
zpuino20_pipistrello_lx45.upload.size_sections=all
zpuino20_pipistrello_lx45.upload.speed=1000000
zpuino20_pipistrello_lx45.upload.tool=zpuinoprogrammer
zpuino20_pipistrello_lx45.build.f_cpu=100000000L
zpuino20_pipistrello_lx45.build.core=zpuino
zpuino20_pipistrello_lx45.build.mcu=zpu
zpuino20_pipistrello_lx45.build.toolchain=zpu
zpuino20_pipistrello_lx45.build.board=ZPUINO_PIPISTRELLO
zpuino20_pipistrello_lx45.build.extra_flags=-D__ZPUINO_PIPISTRELLO__ -DBOARD_ID=0xBA011A00 -DBOARD_MEMORYSIZE=0x4000000 -nostartfiles
zpuino20_pipistrello_lx45.build.extraSflags=-DBOARD_ID=0xBA011A00 
##############################################################
zpuino20_papilio_duo2m.name=ZPUino 2.0 on Papilio DUO (LX9 with 2MB SRAM)
zpuino20_papilio_duo2m.boardid=0xB4051500
zpuino20_papilio_duo2m.upload.protocol=zpuino-serial
zpuino20_papilio_duo2m.upload.maximum_size=8388608
zpuino20_papilio_duo2m.upload.size_sections=all
zpuino20_papilio_duo2m.upload.speed=1000000
zpuino20_papilio_duo2m.upload.tool=zpuinoprogrammer
zpuino20_papilio_duo2m.build.f_cpu=96000000L
zpuino20_papilio_duo2m.build.core=zpuino
zpuino20_papilio_duo2m.build.mcu=zpu
zpuino20_papilio_duo2m.build.toolchain=zpu
zpuino20_papilio_duo2m.build.board=ZPUINO_PAPILIO_PRO
zpuino20_papilio_duo2m.build.extra_flags=-D__ZPUINO_PAPILIO_DUO__ -DZPU20 -DBOARD_ID=0xB4051500 -DBOARD_MEMORYSIZE=0x200000 -nostartfiles
zpuino20_papilio_duo2m.build.extraSflags=-DBOARD_ID=0xB4051500
##############################################################
